app/controllers/messages_controller.rb

INSERT INTO "messages" ("what_to_do", "created_at", "body", "updated_at", "recipient_id", "user_id") VALUES('do a little dance!', '2011-03-20 23:37:58', 'im posting from another app via oauth! ', '2011-03-20 23:37:58', NULL, 99)
---
  def create
    @message = current_user.messages.new(params[:message])

    # email to mailing list

    # broadcast to yammer

    # send to cohuman

    respond_to do |format|
      if @message.save

SELECT * FROM "messages" WHERE ("messages"."id" = '740') LIMIT 1
---
  def show

    @message = Message.find_by_id(params[:id])