app/controllers/oauth_consumers_controller.rb

SELECT * FROM "consumer_tokens" WHERE ("consumer_tokens"."service" = 'yammer') AND ("consumer_tokens".user_id = 99) LIMIT 1
---
  def index
    @consumer_tokens=ConsumerToken.all :conditions=>{:user_id=>current_user.id}
    @services=OAUTH_CREDENTIALS.keys-@consumer_tokens.collect{|c| c.class.service_name}