app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "last_request_at", "created_at", "crypted_password", "updated_at", "fullname", "current_login_ip", "password_salt", "current_login_at", "phone_number", "persistence_token", "login_count", "mailing_list", "last_login_ip", "bio", "last_login_at", "email") VALUES('alainbloch', '2011-03-20 23:16:04', '2011-03-20 23:16:04', 'dad6822b2fe8e0db4f1863324458b0a7d52862b6b0ae1fdb00f76f708cf02b25b67425926f87306a98b304a2f00e3039f437fffebf49becb988a7c30042eeaa2', '2011-03-20 23:16:04', NULL, '127.0.0.1', 'u2QMGWNiN57q1v6EEMO', '2011-03-20 23:16:04', '9162143917', 'ed9493420ebae75e4fb7a85c7bfe65bd0fd4b2feef5edd04868aa6769eb2e1292910b61b0a5898d046132034ace3d8f42633db8c8ae99f861a9f54b592faf6ee', 1, '', NULL, NULL, NULL, 'alainbloch@gmail.com')

  def show
    respond_to do |format|
    @messages = @user.messages.paginate(:page => params[:page], :per_page => 8, :order => "created_at DESC")
---
SELECT * FROM "messages" WHERE ("messages".user_id = 200) ORDER BY created_at DESC LIMIT 8 OFFSET 0