app/controllers/yammer_controller.rb

INSERT INTO "consumer_tokens" ("created_at", "token", "updated_at", "service", "user_id", "type", "secret") VALUES('2011-03-20 23:11:50', 'gSh0N2XmrrocPDE6bHJg', '2011-03-20 23:11:50', 'yammer', 100, NULL, '3YQgWJMCZOGfrJyuKJtiLYG6py4Bdpkw4i9JS14Saw')
---
  def auth
    oauth_verifier = params[:oauth_verifier]
    access_token = Yammer.get_access_token(session[:yammer_request_token], oauth_verifier)
    if access_token
      consumer_token = ConsumerToken.create(:user => current_user,
                                            :service => "yammer",
                                            :token   => access_token.token,
                                            :secret  => access_token.secret)